# London Housing Data Analysis

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("house.csv")

In [41]:
df.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,0.0
1,1995-02-01,city of london,82203,E09000001,7.0,0.0
2,1995-03-01,city of london,79121,E09000001,14.0,0.0
3,1995-04-01,city of london,77101,E09000001,7.0,0.0
4,1995-05-01,city of london,84409,E09000001,10.0,0.0

In [42]:
df.tail()

            date     area  average_price       code  houses_sold  no_of_crimes
13544 2019-09-01  england         249942  E92000001      64605.0           0.0
13545 2019-10-01  england         249376  E92000001      68677.0           0.0
13546 2019-11-01  england         248515  E92000001      67814.0           0.0
13547 2019-12-01  england         250410  E92000001          0.0           0.0
13548 2020-01-01  england         247355  E92000001          0.0           0.0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           13549 non-null  object
 1   area           13549 non-null  object
 2   average_price  13549 non-null  int64
 3   code           13549 non-null  object
 4   houses_sold    13455 non-null  float64
 5   no_of_crimes   7439 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 635.2+ KB

In [12]:
df.shape

(13549, 6)

In [6]:
# finding the null values

df.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [7]:
df.fillna(0, inplace=True)

In [8]:
df.isnull().sum()

date             0
area             0
average_price    0
code             0
houses_sold      0
no_of_crimes     0
dtype: int64

In [13]:
df.count()

date             13549
area             13549
average_price    13549
code             13549
houses_sold      13549
no_of_crimes     13549
dtype: int64

In [9]:
df.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,0.0
1,2/1/1995,city of london,82203,E09000001,7.0,0.0
2,3/1/1995,city of london,79121,E09000001,14.0,0.0
3,4/1/1995,city of london,77101,E09000001,7.0,0.0
4,5/1/1995,city of london,84409,E09000001,10.0,0.0

In [14]:
# Convert the Datatype of "date" column to Date-Time format

df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,0.0
1,2/1/1995,city of london,82203,E09000001,7.0,0.0

In [17]:
type(df['date'])

pandas.core.series.Series

In [18]:
df.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
dtype: object

In [19]:
df.date = pd.to_datetime(df.date)

In [20]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,0.0
1,1995-02-01,city of london,82203,E09000001,7.0,0.0

In [21]:
df.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

In [22]:
# add a new column in the dataframe, which containes years only

df["year"] = df.date.dt.year

In [23]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,city of london,91449,E09000001,17.0,0.0,1995
1,1995-02-01,city of london,82203,E09000001,7.0,0.0,1995

In [36]:
# add a new column "month" as the 2nd column in the dataframe

df.insert(1, "month", df.date.dt.month)

In [37]:
df.head(2)

,date,month,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,1,city of london,91449,E09000001,17.0,0.0,1995
1,1995-02-01,2,city of london,82203,E09000001,7.0,0.0,1995

In [38]:
# remove the columns eyar and month from the dataframe

df.drop(["year", "month"], axis = 1, inplace = True)

In [39]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,0.0
1,1995-02-01,city of london,82203,E09000001,7.0,0.0

In [40]:
# Show all the crimes where number of crimes is 0

df[df.no_of_crimes == 0]

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,0.0
1,1995-02-01,city of london,82203,E09000001,7.0,0.0
2,1995-03-01,city of london,79121,E09000001,14.0,0.0
3,1995-04-01,city of london,77101,E09000001,7.0,0.0
4,1995-05-01,city of london,84409,E09000001,10.0,0.0
...,...,...,...,...,...,...
13544,2019-09-01,england,249942,E92000001,64605.0,0.0
13545,2019-10-01,england,249376,E92000001,68677.0,0.0
13546,2019-11-01,england,248515,E92000001,67814.0,0.0
13547,2019-12-01,england,250410,E92000001,0.0,0.0
13548,2020-01-01,england,247355,E92000001,0.0,0.0

In [43]:
# what is the maximum and minimum "average_price" per year in england
df["year"] = df.date.dt.year

In [44]:
df.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,city of london,91449,E09000001,17.0,0.0,1995
1,1995-02-01,city of london,82203,E09000001,7.0,0.0,1995

In [45]:
dff = df[df.area == "england"]

In [46]:
dff.head(2)

,date,area,average_price,code,houses_sold,no_of_crimes,year
13248,1995-01-01,england,53203,E92000001,47639.0,0.0,1995
13249,1995-02-01,england,53096,E92000001,47880.0,0.0,1995

In [47]:
dff.groupby("year").average_price.max()

year
1995     53901
1996     55755
1997     61564
1998     65743
1999     75071
2000     84191
2001     95992
2002    119982
2003    138985
2004    160330
2005    167244
2006    182031
2007    194764
2008    191750
2009    174136
2010    180807
2011    177335
2012    180129
2013    188544
2014    203639
2015    219582
2016    231922
2017    242628
2018    248620
2019    250410
2020    247355
Name: average_price, dtype: int64

In [48]:
dff.groupby("year").average_price.min()

year
1995     52788
1996     52333
1997     55789
1998     61659
1999     65522
2000     75219
2001     84245
2002     96215
2003    121610
2004    139719
2005    158572
2006    166544
2007    181824
2008    165795
2009    159340
2010    174458
2011    173046
2012    174161
2013    176816
2014    188265
2015    202856
2016    220361
2017    231593
2018    240428
2019    243281
2020    247355
Name: average_price, dtype: int64

In [49]:
# mean average_price

dff.groupby("year").average_price.mean()

year
1995     53322.416667
1996     54151.500000
1997     59160.666667
1998     64301.666667
1999     70070.750000
2000     80814.333333
2001     90306.750000
2002    107981.500000
2003    130218.583333
2004    152314.416667
2005    163570.000000
2006    174351.500000
2007    190025.583333
2008    182379.916667
2009    166558.666667
2010    177472.666667
2011    175230.000000
2012    177488.000000
2013    182581.416667
2014    197771.083333
2015    211174.750000
2016    227337.166667
2017    238161.166667
2018    245018.333333
2019    247101.083333
2020    247355.000000
Name: average_price, dtype: float64

In [54]:
# what is the maximum and minimum number of crimes recorded per area

df.groupby("area").no_of_crimes.max().sort_values(ascending = False)

area
westminster               7461.0
lambeth                   4701.0
camden                    4558.0
southwark                 3821.0
newham                    3668.0
hackney                   3466.0
ealing                    3401.0
islington                 3384.0
tower hamlets             3316.0
croydon                   3263.0
haringey                  3199.0
wandsworth                3051.0
waltham forest            2941.0
brent                     2937.0
barnet                    2893.0
greenwich                 2853.0
hillingdon                2819.0
hounslow                  2817.0
lewisham                  2813.0
enfield                   2798.0
kensington and chelsea    2778.0
hammersmith and fulham    2645.0
bromley                   2637.0
redbridge                 2560.0
barking and dagenham      2049.0
havering                  1956.0
bexley                    1914.0
harrow                    1763.0
merton                    1623.0
richmond upon thames      1551.0
sutton                    1425.0
kingston upon thames      1379.0
city of london              10.0
england                      0.0
west midlands                0.0
east midlands                0.0
east of england              0.0
south east                   0.0
south west                   0.0
inner london                 0.0
outer london                 0.0
north west                   0.0
north east                   0.0
london                       0.0
yorks and the humber         0.0
Name: no_of_crimes, dtype: float64

In [51]:
df.groupby("area").no_of_crimes.min()

area
barking and dagenham      0.0
barnet                    0.0
bexley                    0.0
brent                     0.0
bromley                   0.0
camden                    0.0
city of london            0.0
croydon                   0.0
ealing                    0.0
east midlands             0.0
east of england           0.0
enfield                   0.0
england                   0.0
greenwich                 0.0
hackney                   0.0
hammersmith and fulham    0.0
haringey                  0.0
harrow                    0.0
havering                  0.0
hillingdon                0.0
hounslow                  0.0
inner london              0.0
islington                 0.0
kensington and chelsea    0.0
kingston upon thames      0.0
lambeth                   0.0
lewisham                  0.0
london                    0.0
merton                    0.0
newham                    0.0
north east                0.0
north west                0.0
outer london              0.0
redbridge                 0.0
richmond upon thames      0.0
south east                0.0
south west                0.0
southwark                 0.0
sutton                    0.0
tower hamlets             0.0
waltham forest            0.0
wandsworth                0.0
west midlands             0.0
westminster               0.0
yorks and the humber      0.0
Name: no_of_crimes, dtype: float64

In [55]:
# show the total counts of records of each area where average price is less than 100000

df[df.average_price < 100000].area.value_counts()

area
north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
bexley                   64
waltham forest           64
lewisham                 62
havering                 60
south east               59
greenwich                59
croydon                  57
enfield                  54
sutton                   54
hackney                  53
redbridge                52
southwark                48
tower hamlets            47
outer london             46
hillingdon               44
lambeth                  41
hounslow                 41
brent                    40
london                   39
merton                   35
haringey                 33
bromley                  33
inner london             31
ealing                   31
kingston upon thames     30
harrow                   30
wandsworth               26
barnet                   25
islington                19
city of london           11
Name: count, dtype: int64